'''
Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
'''

n = input("Введите трехзначное число: ")

a = int(n[0])
b = int(n[1])
c = int(n[2])

print("Сумма цифр числа:", a + b + c)

'''
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

*Пример:*

6 -> 1  4  1
24 -> 4  16  4
    60 -> 10  40  10
'''

S = int(input("Введите общее количество журавликов: "))

sergey = S / 6
petr = sergey
kate = (sergey + petr) * 2

print(int(sergey), int(kate), int(petr))

'''
Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
Вам требуется написать программу, которая проверяет счастливость билета.

*Пример:*

385916 -> yes
123456 -> no
'''

s = str(input("Введите шестизначное число: "))

sum1 = int(s[0])+int(s[1])+int(s[2])
sum2 = int(s[3])+int(s[4])+int(s[5])

if sum1 == sum2:
  print('Счастливый')
else:
  print('Обычный')


'''
Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

*Пример:*

3 2 4 -> yes
3 2 1 -> no
'''

n = int(input("n: "))
m = int(input("m: "))
k = int(input("k: "))
if k < n * m and ((k % n == 0) or (k % m == 0)):
    print('YES')
else:
    print('NO')
